package com.bigdata.test.laosiji.test.utils;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class StringSplit {

    public static void main(String[] args) throws Exception {
        StringBuffer sb = new StringBuffer();
        sb.append("Contents前言第1章　Elasticsearch入门11.1　Elasticsearch是什么11.1.1　Elasticsearch的历史21.1.2　相关产品31.2　全文搜索31.2.1　Lucene介绍41.2.2　Lucene倒排索引41.3　基础知识61.3.1　Elasticsearch术语及概念61.3.2　JSON介绍101.4　安装配置121.4.1　安装Java121.4.2　安装Elasticsearch121.4.3　配置131.4.4　运行151.4.5　停止171.4.6　作为服务171.4.7　版本升级191.5　对外接口211.5.1　API约定221.5.2　REST介绍251.5.3　Head插件安装261.5.4　创建库271.5.5　插入数据281.5.6　修改文档281.5.7　查询文档291.5.8　删除文档291.5.9　删除库301.6　Java接口301.6.1　Java接口说明301.6.2　创建索引文档331.6.3　增加文档341.6.4　修改文档351.6.5　查询文档351.6.6　删除文档351.7　小结36第2章　索引372.1　索引管理372.1.1　创建索引372.1.2　删除索引392.1.3　获取索引392.1.4　打开/关闭索引402.2　索引映射管理412.2.1　增加映射412.2.2　获取映射442.2.3　获取字段映射452.2.4　判断类型是否存在462.3　索引别名462.4　索引配置512.4.1　更新索引配置512.4.2　获取配置522.4.3　索引分析522.4.4　索引模板542.4.5　复制配置552.4.6　重建索引562.5　索引监控602.5.1　索引统计602.5.2　索引分片622.5.3　索引恢复632.5.4　索引分片存储642.6　状态管理642.6.1　清除缓存642.6.2　索引刷新642.6.3　冲洗652.6.4　合并索引652.7　文档管理662.7.1　增加文档662.7.2　更新删除文档692.7.3　查询文档732.7.4　多文档操作762.7.5　索引词频率802.7.6　查询更新接口832.8　小结87第3章　映射883.1　概念883.2　字段数据类型903.2.1　核心数据类型913.2.2　复杂数据类型963.2.3　地理数据类型1003.2.4　专门数据类型1063.3　元字段1083.3.1　_all字段1093.3.2　_field_names字段1093.3.3　_id字段1103.3.4　_index字段1103.3.5　_meta字段1113.3.6　_parent字段1113.3.7　_routing字段1123.3.8　_source字段1143.3.9　_type字段1153.3.10　_uid字段1153.4　映射参数1163.4.1　analyzer参数1163.4.2　boost参数1183.4.3　coerce参数1193.4.4　copy_to参数1203.4.5　doc_values参数1213.4.6　dynamic参数1223.4.7　enabled参数1223.4.8　fielddata参数1233.4.9　format参数1263.4.10　geohash参数1283.4.11　geohash_precision参数1293.4.12　geohash_prefix参数1303.4.13　ignore_above参数1313.4.14　ignore_malformed参数1313.4.15　include_in_all参数1323.4.16　index参数1333.4.17　index_options参数1333.4.18　lat_lon参数1343.4.19　fields参数1353.4.20　norms参数1363.4.21　null_value参数1373.4.22　position_increment_gap参数1373.4.23　precision_step参数1383.4.24　properties参数1383.4.25　search_analyzer参数1393.4.26　similarity参数1403.4.27　store参数1413.4.28　term_vector参数1413.5　动态映射1423.5.1　概念1423.5.2　_default_映射1433.5.3　动态字段映射1433.5.4　动态模板1453.5.5　重写默认模板1483.6　小结148第4章　搜索1494.1　深入搜索1494.1.1　搜索方式1494.1.2　重新评分1534.1.3　滚动查询请求1554.1.4　隐藏内容查询1584.1.5　搜索相关函数1614.1.6　搜索模板1644.2　查询DSL1674.2.1　查询和过滤的区别1674.2.2　全文搜索1684.2.3　字段查询1794.2.4　复合查询1834.2.5　连接查询1884.2.6　地理查询1904.2.7　跨度查询1974.2.8　高亮显示2004.3　简化查询2034.4　小结206第5章　聚合2075.1　聚合的分类2075.2　度量聚合2095.2.1　平均值聚合2095.2.2　基数聚合2115.2.3　最大值聚合2135.2.4　最小值聚合2145.2.5　和聚合2145.2.6　值计数聚合2155.2.7　统计聚合2155.2.8　百分比聚合2155.2.9　百分比分级聚合2165.2.10　最高命中排行聚合2175.2.11　脚本度量聚合2175.2.12　地理边界聚合2215.2.13　地理重心聚合2225.3　分组聚合2235.3.1　子聚合2245.3.2　直方图聚合2265.3.3　日期直方图聚合2305.3.4　时间范围聚合2335.3.5　范围聚合2345.3.6　过滤聚合2355.3.7　多重过滤聚合2365.3.8　空值聚合2385.3.9　嵌套聚合2395.3.10　采样聚合2405.3.11　重要索引词聚合2425.3.12　索引词聚合2455.3.13　总体聚合2515.3.14　地理点距离聚合2515.3.15　地理散列网格聚合2535.3.16　IPv4范围聚合2555.4　管道聚合2575.4.1　平均分组聚合2595.4.2　移动平均聚合2615.4.3　总和分组聚合2625.4.4　总和累计聚合2625.4.5　最大分组聚合2645.4.6　最小分组聚合2655.4.7　统计分组聚合2665.4.8　百分位分组聚合2685.4.9　差值聚合2695.4");
        String[] str = sb.toString().split("　");
        for(int i=0;i<str.length;i++){
            System.out.println(str[i].toString());
            //数字
            Pattern pattern = Pattern.compile("\\d+");
            Matcher matcher = pattern.matcher(str[i].toString());
            while (matcher.find()) {
          //      System.out.println(matcher.group(0));
            }

            //非数字
            Pattern pattern01 = Pattern.compile("\\D+");
            Matcher matcher01 = pattern.matcher(str[i].toString());
            while (matcher.find()) {
                System.out.println(matcher.group(0));
            }
        }
    }
}
